import { Path, textsMap } from "../Path_Rank";
import { ELang } from "../langEnum_Rank";

let lang = ELang.ar;

let text = textsMap[lang] = new Path();

text.path0 = `عالي الرتبة`;
text.path1 = `اللاعب`;
text.path2 = `النتيجة`;
text.path3 = `جائزة`;
text.path7 = `القواعد`;
text.path8 = `1. يحصل كل لاعب يراهن على نقاط في لوحة المتصدرين بناءً على قيمة رهانه، ويُمنح مكافآت وفقًا لنقاطه.

2. يمكن لأفضل 10 لاعبين في اليوم استلام مكافآتهم اليومية في لوحة المتصدرين بعد منتصف الليل.

3. يمكن لأفضل 10 لاعبين في الأسبوع استلام مكافآتهم الأسبوعية في لوحة المتصدرين بعد منتصف الليل يوم السبت.

4. تنبيه: تبدأ القائمة يوم الأحد وتنتهي يوم السبت. يجب استلام المكافآت خلال 24 ساعة من نهاية فترة لوحة المتصدرين المعنية؛ وتنتهي صلاحية المكافآت بعد هذه الفترة.`;
text.path9 = `...جارٍ التحميل`;
text.path10 = `عالي الرتبة`;
text.path11 = `تأكيد`;
text.path12 = `تهانينا على إنهاء <color=#FFFF00>{0}</c> في الدوري والحصول على المكافأة <color=#FFFF00>{1}</c>`;