import { Path, textsMap } from "../Path_Rank";
import { ELang } from "../langEnum_Rank";

let lang = ELang.bn;

let text = textsMap[lang] = new Path();

text.path0 = `র‍্যাঙ্কিং`;
text.path1 = `খেলোয়াড়`;
text.path2 = `স্কোর`;
text.path3 = `পুরস্কার`;
text.path7 = `নিয়মাবলী`;
text.path8 = `১. বাজি রাখা প্রত্যেক খেলোয়াড় তাদের বাজির পরিমাণের উপর ভিত্তি করে লিডারবোর্ড পয়েন্ট পাবেন এবং তাদের সংশ্লিষ্ট পয়েন্ট অনুযায়ী পুরস্কার প্রদান করা হবে;

২. দিনের সেরা ১০ জন খেলোয়াড় ২৪:০০-এর পর তাদের দৈনিক লিডারবোর্ড পুরস্কার দাবি করতে পারবেন;

৩. সপ্তাহের সেরা ১০ জন খেলোয়াড় শনিবার ২৪:০০-এর পর তাদের সাপ্তাহিক লিডারবোর্ড পুরস্কার দাবি করতে পারবেন;

৪. সতর্কতা: তালিকাটি রবিবার শুরু হয়ে শনিবার শেষ হবে। সংশ্লিষ্ট লিডারবোর্ড সময়কাল শেষ হওয়ার ২৪ ঘণ্টার মধ্যে পুরস্কার দাবি করতে হবে; এই সময়ের পর পুরস্কারের মেয়াদ শেষ হয়ে যাবে।`;
text.path9 = `লোড হচ্ছে...`;
text.path10 = `র‍্যাঙ্কিং`;
text.path11 = `নিশ্চিত করুন`;
text.path12 = `লীগে <color=#FFFF00>{0}</c> স্থান অর্জন এবং <color=#FFFF00>{1}</c> বোনাস প্রাপ্তির জন্য অভিনন্দন`;