import { Path, textsMap } from "../Path_Rank";
import { ELang } from "../langEnum_Rank";

let lang = ELang.hi;

let text = textsMap[lang] = new Path();

text.path0 = `रैंकिंग`;
text.path1 = `प्लेयर`;
text.path2 = `स्कोर`;
text.path3 = `पुरस्कार`;
text.path7 = `नियम`;
text.path8 = `1. बेट लगाने वाले हर प्लेयर को उनके बेट अमाउंट के आधार पर लीडरबोर्ड पॉइंट्स मिलेंगे, और उनके पॉइंट्स के हिसाब से रिवॉर्ड दिए जाएंगे;

2. दिन के टॉप 10 प्लेयर्स 24:00 बजे के बाद अपने डेली लीडरबोर्ड रिवॉर्ड्स क्लेम कर सकते हैं;

3. हफ़्ते के टॉप 10 प्लेयर्स शनिवार को 24:00 बजे के बाद अपने वीकली लीडरबोर्ड रिवॉर्ड्स क्लेम कर सकते हैं;

4. चेतावनी: लिस्ट रविवार को शुरू होती है और शनिवार को खत्म होती है। रिवॉर्ड्स को संबंधित लीडरबोर्ड पीरियड के खत्म होने के 24 घंटे के अंदर क्लेम करना होगा; इस पीरियड के बाद रिवॉर्ड्स एक्सपायर हो जाते हैं।`;
text.path9 = `लोड हो रहा है...`;
text.path10 = `रैंकिंग`;
text.path11 = `कन्फ़र्म करें`;
text.path12 = `लीग में <color=#FFFF00>{0}</c> स्थान पर पहुंचने और बोनस <color=#FFFF00>{1}</c> प्राप्त करने पर बधाई`;