import { Path, textsMap } from "../Path_Rank";
import { ELang } from "../langEnum_Rank";

let lang = ELang.th;

let text = textsMap[lang] = new Path();

text.path0 = `อันดับ`;
text.path1 = `ผู้เล่น`;
text.path2 = `คะแนน`;
text.path3 = `รางวัล`;
text.path7 = `กฎ`;
text.path8 = `1. ผู้เล่นทุกคนที่วางเดิมพันจะได้รับคะแนนจัดอันดับตามจำนวนเงินเดิมพัน และจะได้รับรางวัลตามคะแนนที่ได้รับ

2. ผู้เล่น 10 อันดับแรกของวันสามารถรับรางวัลจัดอันดับประจำวันได้หลังเวลา 24:00 น.

3. ผู้เล่น 10 อันดับแรกของสัปดาห์สามารถรับรางวัลจัดอันดับประจำสัปดาห์ได้หลังเวลา 24:00 น. ของวันเสาร์

4. คำเตือน: รายชื่อเริ่มต้นในวันอาทิตย์และสิ้นสุดในวันเสาร์ ต้องรับรางวัลภายใน 24 ชั่วโมงหลังจากสิ้นสุดช่วงเวลาจัดอันดับ รางวัลจะหมดอายุหลังจากนั้น`;
text.path9 = `กำลังโหลด...`;
text.path10 = `อันดับ`;
text.path11 = `ยืนยัน`;
text.path12 = `ขอแสดงความยินดีที่คุณได้อันดับที่ <color=#FFFF00>{0}</c> ในลีกและได้รับโบนัส <color=#FFFF00>{1}</c>`;