import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.fa;

let text = textsMap[lang] = new Path();

text.path3 = `اتصال شما قطع شد. 
آیا در دستگاه دیگری وارد شده‌اید؟`;
text.path4 = `اتصال مجدد`;
text.path5 = `خروج`;
text.path6 = `اتصال شما قطع شد.`;
text.path7 = `اتصال مجدد`;
text.path8 = `خروج`;
text.path9 = `این حساب نمی‌تواند در این بازی شرکت کند.`;
text.path10 = `خروج`;
text.path11 = `نوسان شبکه.\n لطفاً دوباره تلاش کنید!`;
text.path12 = `تأیید`;
text.path13 = `خروج`;
text.path14 = `موجودی ناکافی است!
آیا می‌خواهید شارژ کنید؟`;
text.path15 = `تأیید`;
text.path16 = `انصراف`;
text.path17 = `انصراف`;
text.path18 = `اطلاعیه`;
text.path19 = `شما برای سرگرمی وارد بازی می‌شوید. هر برد یا باخت در بازی بر عهده خود شماست. اگر مایلید، روی «شروع» کلیک کنید و از بازی لذت ببرید.`;
text.path20 = `شروع`;
text.path21 = `بستن`;

text.path22 = `اطلاعیه`;
text.path23 = `دوست عزیز، امروز بازی‌های زیادی انجام دادید، بهتر است کمی استراحت کنید`;
text.path24 = `ادامه بازی`;
text.path25 = `استراحت ۲۴ساعت`;

text.path26 = `اطلاعیه`;
text.path27 = `دوست عزیز، پس از ورود به دوره خنک‌شدن، تا ۲۴ ساعت آینده نمی‌توانید بازی کنید. آیا می‌خواهید وارد دوره خنک‌شدن شوید؟`;
text.path28 = `ادامه بازی`;
text.path29 = `تأیید ورود`;

text.path30 = `بازی در دوره خنک‌شدن است`;
text.path31 = `شما وارد دوره خنک‌شدن شده‌اید، زمان باقی‌مانده:`;
text.path32 = `خروج از بازی`;

text.path33 = `به دلیل بیکاری طولانی، اتصال پس از شمارش معکوس قطع خواهد شد.`;
text.path34 = `وای! مدت‌هاست بازی نکرده‌اید~ لطفاً دوباره وارد بازی شوید و مهارت‌هایتان را به نمایش بگذارید!`;
text.path35 = `ادامه`;

text.path36 = `هشدار، لطفاً قوانین بازی را رعایت کنید!`;
text.path37 = `ادامه`;

text.path38 = `سرور بازی در حال تعمیر و نگهداری است و موقتاً قابل بازی نیست. 
لطفاً بعداً دوباره تلاش کنید.`;
text.path39 = `خروج`;

text.path40 = `سکه‌ها موقتاً مسدود شده‌اند، لطفاً با تیم عملیات رسمی تماس بگیرید.`;
text.path41 = `خروج`;
