import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.hi;

let text = textsMap[lang] = new Path();

text.path3 = `आपका कनेक्शन टूट गया है।
क्या आपने किसी अन्य डिवाइस में लॉग इन किया है?`;
text.path4 = `रिकनेक्ट`;
text.path5 = `बाहर निकलें`;
text.path6 = `आपका कनेक्शन टूट गया है।`;
text.path7 = `रिकनेक्ट`;
text.path8 = `बाहर निकलें`;
text.path9 = `यह खाता इस गेम में भाग नहीं ले सकता।`;
text.path10 = `बाहर निकलें`;
text.path11 = `नेटवर्क में उतार-चढ़ाव; कृपया पुनः प्रयास करें!`;
text.path12 = `पुष्टि करें`;
text.path13 = `बाहर निकलें`;
text.path14 = `शेष राशि पर्याप्त नहीं है!
अभी रिचार्ज करें?`;
text.path15 = `पुष्टि करें`;
text.path16 = `रद्द करें`;
text.path17 = `रद्द करें`;
text.path18 = `सूचना`;
text.path19 = `आप मनोरंजन के लिए गेम में प्रवेश कर रहे हैं। गेम में कोई भी जीत या हानि आपकी अपनी जिम्मेदारी है। यदि आप सहमत हैं, तो कृपया 'शुरू करें' पर क्लिक करें और गेम का आनंद लें।`;
text.path20 = `शुरू करें`;
text.path21 = `बंद करें`;

text.path22 = `सूचना`;
text.path23 = `प्रिय मित्र, आपने आज बहुत अधिक गेम खेल लिए हैं, थोड़ा आराम करना बेहतर होगा`;
text.path24 = `गेम जारी रखें`;
text.path25 = `24 घंटे आराम`;

text.path26 = `सूचना`;
text.path27 = `प्रिय मित्र, कूलिंग-ऑफ पीरियड में प्रवेश करने के बाद अगले 24 घंटे तक आप गेम नहीं खेल पाएंगे। क्या आप कूलिंग-ऑफ पीरियड में प्रवेश करना चाहते हैं?`;
text.path28 = `गेम जारी रखें`;
text.path29 = `प्रवेश की पुष्टि करें`;

text.path30 = `गेम कूलिंग-ऑफ पीरियड में है`;
text.path31 = `आपने कूलिंग-ऑफ पीरियड में प्रवेश चुना है, शेष समय:`;
text.path32 = `गेम से बाहर निकलें`;

text.path33 = `बहुत लंबे समय तक निष्क्रिय रहने के कारण, उल्टी गिनती के बाद लाइन काट दी जाएगी।`;
text.path34 = `ओह! आपने बहुत समय से खेल नहीं खेला है~ कृपया खेल में पुनः प्रवेश करें और अपना कौशल दिखाएं!`;
text.path35 = `जारी रखें`;

text.path36 = `चेतावनी, कृपया खेल के नियमों का पालन करें!`;
text.path37 = `जारी रखें`;

text.path38 = `गेम सर्वर मेंटेनेंस में है और इसे कुछ समय के लिए नहीं खेला जा सकता।
कृपया बाद में फिर से कोशिश करें।`;
text.path39 = `बाहर निकलें`;

text.path40 = `सिक्के अस्थायी रूप से फ़्रीज़ हैं, कृपया आधिकारिक ऑपरेशन टीम से संपर्क करें।`;
text.path41 = `बाहर निकलें`;