import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.ar;

let text = textsMap[lang] = new Path();

text.path3 = `تم قطع اتصالك.
هل قمت بتسجيل الدخول في جهاز آخر؟`;
text.path4 = `أعد الاتصال`;
text.path5 = `خروج`;
text.path6 = `تم قطع اتصالك.`;
text.path7 = `أعد الاتصال`;
text.path8 = `خروج`;
text.path9 = `لا يمكن لهذا الحساب المشاركة في هذه اللعبة.`;
text.path10 = `خروج`;
text.path11 = `تقلبات في الشبكة، يرجى المحاولة مرة أخرى!`;
text.path12 = `تأكيد`;
text.path13 = `خروج`;
text.path14 = `رصيدك غير كافٍ!
هل تريد الشحن الآن؟`;
text.path15 = `تأكيد`;
text.path16 = `إلغاء`;
text.path17 = `إلغاء`;
text.path18 = `تنويه هام`;
text.path19 = `دخولك الى اللعبة للتسلية، ان اي عملية ربح وخسارة في اللعبة على مسؤوليتك الشخصية، اذا كنت ترغب في هذا انقر ابدأ واستمتع باللعبة`;
text.path20 = `ابدأ`;
text.path21 = `اغلاق`;

text.path22 = `تنويه هام`;
text.path23 = `صديقنا، لقد لعبت كثيرا في اللعبة اليوم، خذ قسطا من الراحة`;
text.path24 = `استمر`;
text.path25 = `استريح 24 ساعة`;

text.path26 = `تنويه هام`;
text.path27 = `صديقنا، بعد دخول فترة الاستراحة، لن تتمكن من لعب اللعبة خلال مدة 24 ساعة القادمة، هل تريد الدخول في فترة الاستراحة؟`;
text.path28 = `استمر`;
text.path29 = `تأكيد الاستراحة`;

text.path30 = `اللعبة في فترة الاستراحة`;
text.path31 = `لقد اخترت الدخول في فترة الاستراحة، ويبقى وقت الاستراحة:`;
text.path32 = `الخروج من اللعبة`;

text.path33 = `نظرًا لعدم النشاط لفترة طويلة، سيتم قطع الاتصال بعد انتهاء العد التنازلي.`;
text.path34 = `أُووبس! لم تلعب منذ فترة طويلة
يرجى إعادة الدخول إلى اللعبة وإظهار مهاراتك`;
text.path35 = `متابعة`;

text.path36 = `تحذير، يرجى اتباع قواعد اللعبة!`;
text.path37 = `متابعة`;

text.path38 = `خادم اللعبة يخضع للصيانة ولا يمكن اللعب عليه مؤقتًا. 
يرجى المحاولة مرة أخرى لاحقًا.`;
text.path39 = `خروج`;

text.path40 = `العملات مجمدة مؤقتًا، يرجى التواصل مع فريق التشغيل الرسمي.`;
text.path41 = `خروج`;