import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.bn;

let text = textsMap[lang] = new Path();

text.path3 = `আপনার সংযোগ বিচ্ছিন্ন হয়েছে।
আপনি কি অন্য ডিভাইসে লগ ইন করেছেন?`;
text.path4 = `পুনরায় সংযোগ করুন`;
text.path5 = `প্রস্থান করুন`;
text.path6 = `আপনার সংযোগ বিচ্ছিন্ন হয়েছে।`;
text.path7 = `পুনরায় সংযোগ করুন`;
text.path8 = `প্রস্থান করুন`;
text.path9 = `এই অ্যাকাউন্টটি এই গেমে অংশ নিতে পারবে না।`;
text.path10 = `প্রস্থান করুন`;
text.path11 = `নেটওয়ার্ক সমস্যার কারণে অর্ডার প্রক্রিয়াকরণ ব্যর্থ হয়েছে। অনুগ্রহ করে পরে আবার চেষ্টা করুন।`;
text.path12 = `নিশ্চিত করুন`;
text.path13 = `প্রস্থান করুন`;
text.path14 = `ব্যালেন্স যথেষ্ট নয়!
এখন রিচার্জ করতে চান?`;
text.path15 = `নিশ্চিত করুন`;
text.path16 = `বাতিল করুন`;
text.path17 = `বাতিল করুন`;
text.path18 = `বিজ্ঞপ্তি`;
text.path19 = `আপনি বিনোদনের জন্য গেমে প্রবেশ করছেন। গেমের যেকোনো জয় বা পরাজয় আপনার নিজের দায়িত্বে। আপনি রাজি থাকলে 'শুরু' ক্লিক করুন এবং গেম উপভোগ করুন।`;
text.path20 = `শুরু`;
text.path21 = `বন্ধ করুন`;

text.path22 = `বিজ্ঞপ্তি`;
text.path23 = `প্রিয় বন্ধু, আজ আপনি অনেক বেশি গেম খেলেছেন, একটু বিশ্রাম নেওয়াই ভালো হবে`;
text.path24 = `গেম চালিয়ে যান`;
text.path25 = `২৪ ঘণ্টা বিশ্রাম`;

text.path26 = `বিজ্ঞপ্তি`;
text.path27 = `প্রিয় বন্ধু, কুলিং-অফ পিরিয়ডে প্রবেশ করলে আগামী ২৪ ঘণ্টা আপনি গেম খেলতে পারবেন না। আপনি কি কুলিং-অফ পিরিয়ডে প্রবেশ করতে চান?`;
text.path28 = `গেম চালিয়ে যান`;
text.path29 = `প্রবেশ নিশ্চিত করুন`;

text.path30 = `গেম এখন কুলিং-অফ পিরিয়ডে`;
text.path31 = `আপনি কুলিং-অফ পিরিয়ডে প্রবেশ করেছেন, অবশিষ্ট সময়:`;
text.path32 = `গেম থেকে বেরিয়ে যান`;

text.path33 = `খুব বেশিক্ষণ নিষ্ক্রিয় থাকার কারণে, কাউন্টডাউনের পরে লাইনটি সংযোগ বিচ্ছিন্ন হয়ে যাবে।`;
text.path34 = `ওহো! আপনি অনেক দিন ধরে খেলেননি~ অনুগ্রহ করে আবার গেমটিতে প্রবেশ করুন এবং আপনার দক্ষতা দেখান!`;
text.path35 = `চালিয়ে যান`;

text.path36 = `সতর্কীকরণ, অনুগ্রহ করে খেলার নিয়মাবলী অনুসরণ করুন!`;
text.path37 = `চালিয়ে যান`;

text.path38 = `গেম সার্ভারটি রক্ষণাবেক্ষণের অধীনে থাকায় আপাতত খেলা যাচ্ছে না।
অনুগ্রহ করে পরে আবার চেষ্টা করুন।`;
text.path39 = `প্রস্থান করুন`;

text.path40 = `কয়েন সাময়িকভাবে স্থগিত করা হয়েছে, অনুগ্রহ করে অফিসিয়াল অপারেশন টিমের সাথে যোগাযোগ করুন।`;
text.path41 = `প্রস্থান করুন`;