import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.ur;

let text = textsMap[lang] = new Path();

text.path3 = `آپ کا رابطہ منقطع ہو گیا ہے۔
کیا آپ نے کسی دوسرے آلے میں لاگ ان کیا ہے؟`;
text.path4 = `دوبارہ رابطہ کریں`;
text.path5 = `باہر نکلیں`;
text.path6 = `آپ کا رابطہ منقطع ہو گیا ہے۔`;
text.path7 = `دوبارہ رابطہ کریں`;
text.path8 = `باہر نکلیں`;
text.path9 = `یہ اکاؤنٹ اس گیم میں شامل نہیں ہو سکتا۔`;
text.path10 = `باہر نکلیں`;
text.path11 = `نیٹ ورک میں اتار چڑھاؤ؛ براہ کرم دوبارہ کوشش کریں!`;
text.path12 = `تصدیق کریں`;
text.path13 = `باہر نکلیں`;
text.path14 = `بیلنس کافی نہیں ہے!
ابھی ریچارج کریں؟`;
text.path15 = `تصدیق کریں`;
text.path16 = `منسوخ کریں`;
text.path17 = `منسوخ کریں`;
text.path18 = `اطلاع`;
text.path19 = `آپ تفریح کے لیے گیم میں داخل ہو رہے ہیں۔ گیم میں کوئی بھی جیت یا نقصان آپ کی اپنی ذمہ داری ہے۔ اگر آپ راضی ہیں تو براہ کرم 'شروع کریں' پر کلک کریں اور گیم کا لطف اٹھائیں۔`;
text.path20 = `شروع کریں`;
text.path21 = `بند کریں`;

text.path22 = `اطلاع`;
text.path23 = `عزیز دوست، آپ نے آج بہت زیادہ گیم کھیلی ہے، تھوڑا آرام کرنا بہتر ہوگا`;
text.path24 = `گیم جاری رکھیں`;
text.path25 = `24 گھنٹے آرام کریں`;

text.path26 = `اطلاع`;
text.path27 = `عزیز دوست، کولنگ آف پیریڈ میں داخل ہونے کے بعد اگلے 24 گھنٹے تک آپ گیم نہیں کھیل سکیں گے۔ کیا آپ کولنگ آف پیریڈ میں داخل ہونا چاہتے ہیں؟`;
text.path28 = `گیم جاری رکھیں`;
text.path29 = `داخلے کی تصدیق کریں`;

text.path30 = `گیم کولنگ آف پیریڈ میں ہے`;
text.path31 = `آپ نے کولنگ آف پیریڈ میں داخل ہونا منتخب کیا ہے، باقی وقت:`;
text.path32 = `گیم سے باہر نکلیں`;

text.path33 = `زیادہ دیر تک بے کار رہنے کی وجہ سے الٹی گنتی کے بعد لائن منقطع ہو جائے گی۔`;
text.path34 = `اوہو! آپ نے طویل عرصے سے نہیں کھیلا ہے ~ براہ کرم کھیل میں دوبارہ داخل ہوں اور اپنی مہارت کا مظاہرہ کریں!`;
text.path35 = `جاری رکھیں`;

text.path36 = `انتباہ! کھیل کے قوانین پر عمل کریں`;
text.path37 = `جاری رکھیں`;

text.path38 = `گیم سرور کی دیکھ بھال جاری ہے اور اسے عارضی طور پر نہیں کھیلا جا سکتا۔
براہ کرم بعد میں دوبارہ کوشش کریں۔`;
text.path39 = `باہر نکلیں`;

text.path40 = `سکے عارضی طور پر منجمد ہیں، براہ کرم آفیشل آپریشنز ٹیم سے رابطہ کریں۔`;
text.path41 = `باہر نکلیں`;