import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.ar;

let text = textsMap[lang] = new Path();

text.path3 = `كنت قد قطع الاتصال
هل قمت بتسجيل الدخول إلى جهاز آخر ؟`;
text.path4 = `أعد الاتصال`;
text.path5 = `مخرج`;
text.path6 = `لقد تم فقدان اتصال الشبكة الخاص بك`;
text.path7 = `أعد الاتصال`;
text.path8 = `مخرج`;
text.path9 = `الحساب غير طبيعي، لا يمكن الانضمام إلى اللعبة حاليا، يرجى الاتصال بخدمة العملاء`;
text.path10 = `مخرج`;
text.path11 = `فشل معالجة الطلب بسبب مشكلة في الشبكة. 
يُرجى المحاولة مرة أخرى لاحقًا.`;
text.path12 = `تأكيد`;
text.path13 = `مخرج`;
text.path14 = `،رصيدك غير كافي
هل تريد الشحن الآن؟`;
text.path15 = `تأكيد`;
text.path16 = `إلغاء`;
text.path17 = `إلغاء`;
text.path18 = `تنويه هام`;
text.path19 = `دخولك الى اللعبة للتسلية , ان اي عملية ربح
وخسارة في اللعبة على مسؤوليتك الشخصية اذا
 كنت ترغب في هذا انقر ابدأ واستمتع باللعبة`
text.path20 = `ابدأ`;
text.path21 = `اغلاق`;

text.path22 = `تنويه هام`;
text.path23 = `صديقنا، لقد لعبت كثيرا في اللعبة
اليوم، خذ قسط من الراحة`;
text.path24 = `استمر`;
text.path25 = `استريح 24 ساعة`;

text.path26 = `تنويه هام`;
text.path27 = `صديقنا، بعد دخول فترة الاستراحة،
لن تتمكن من لعب اللعبة خلال
مدة 24 ساعة القادمة، هل تريد الدخول
في فترة الاستراحة؟`;
text.path28 = `استمر`;
text.path29 = `تأكيد الاستراحة`;

text.path30 = `اللعبة في فترة الاستراحة`;
text.path31 = `لقد اخترت الدخول في فترة الاستراحة
ويبقى وقت الاستراحة`;
text.path32 = `الخروج من اللعبة`;

text.path33 = `ونظرًا لبقائه خاملاً لفترة طويلة جدًا، سيتم فصله بعد انتهاء العد التنازلي`;
text.path34 = `أُووبس! لم تلعب منذ فترة طولة
يرجى إعادة الدخول إلى اللعبة وإظهار مهاراتك`;
text.path35 = `حسنا`;

text.path36 = `تحذير، يرجى اتباع قواعد اللعبة`
text.path37 = `حسنا`;