import { Path, textsMap } from "../Path_EX";
import { ELang } from "../langEnum_EX";

let lang = ELang.ru;

let text = textsMap[lang] = new Path();

text.path3 = `Вы отключились. 
Вы вошли в систему на другом устройстве?`;
text.path4 = `Переподключиться`;
text.path5 = `Выход`;
text.path6 = `Вы отключились.`;
text.path7 = `Переподключиться`;
text.path8 = `Выход`;
text.path9 = `Эта учётная запись не может участвовать в этой игре.`;
text.path10 = `Выход`;
text.path11 = `Колебания сети.\n попробуйте ещё раз!`;
text.path12 = `Подтвердить`;
text.path13 = `Выход`;
text.path14 = `Недостаточно средств!
Хотите пополнить баланс?`;
text.path15 = `Подтвердить`;
text.path16 = `Отмена`;
text.path17 = `Отмена`;
text.path18 = `Уведомление`;
text.path19 = `Вы заходите в игру ради развлечения. Любой выигрыш или проигрыш в игре несёте лично вы. Если вы согласны, нажмите «Начать» и наслаждайтесь игрой.`;
text.path20 = `Начать`;
text.path21 = `Закрыть`;

text.path22 = `Уведомление`;
text.path23 = `Дорогой друг, сегодня вы сыграли слишком много игр, было бы лучше немного отдохнуть`;
text.path24 = `Продолжить игру`;
text.path25 = `Отдохнуть 24ч`;

text.path26 = `Уведомление`;
text.path27 = `Дорогой друг, после входа в период охлаждения вы не сможете играть в игру в течение следующих 24 часов. Хотите войти в период охлаждения?`;
text.path28 = `Продолжить игру`;
text.path29 = `Подтвердить вход`;

text.path30 = `Игра в режиме охлаждения`;
text.path31 = `Вы выбрали войти в период охлаждения, осталось времени:`;
text.path32 = `Выйти из игры`;

text.path33 = `Из-за длительного бездействия соединение будет разорвано после обратного отсчёта.`;
text.path34 = `Ой! Вы давно не играли~ Пожалуйста, снова зайдите в игру и покажите свои навыки!`;
text.path35 = `продолжить`;

text.path36 = `Предупреждение, пожалуйста, соблюдайте правила игры!`;
text.path37 = `продолжить`;

text.path38 = `Сервер игры находится на техническом обслуживании и временно недоступен. 
Попробуйте позже.`;
text.path39 = `Выход`;

text.path40 = `Монеты временно заморожены, пожалуйста, свяжитесь с официальной службой поддержки.`;
text.path41 = `Выход`;
