import { Path, textsMap } from "../Path_Rank";
import { ELang } from "../langEnum_Rank";

let lang = ELang.ur;

let text = textsMap[lang] = new Path();

text.path0 = `درجہ بندی`;
text.path1 = `کھلاڑی`;
text.path2 = `سکور`;
text.path3 = `ایوارڈ`;
text.path7 = `قواعد`;
text.path8 = `1. ہر کھلاڑی جو شرط لگاتا ہے اسے اس کی شرط کی رقم کی بنیاد پر لیڈر بورڈ پوائنٹس ملیں گے، اور اس کو ان کے متعلقہ پوائنٹس کے مطابق انعامات سے نوازا جائے گا۔

2. دن کے ٹاپ 10 کھلاڑی 24:00 بجے کے بعد اپنے یومیہ لیڈر بورڈ انعامات کا دعویٰ کر سکتے ہیں۔

3. ہفتے کے ٹاپ 10 کھلاڑی ہفتہ کو 24:00 بجے کے بعد اپنے ہفتہ وار لیڈر بورڈ انعامات کا دعویٰ کر سکتے ہیں۔

4. انتباہ: فہرست اتوار کو شروع ہوتی ہے اور ہفتہ کو ختم ہوتی ہے۔ اسی لیڈر بورڈ کی مدت کے اختتام کے 24 گھنٹوں کے اندر انعامات کا دعوی کرنا ضروری ہے۔ انعامات اس مدت کے بعد ختم ہو جائیں گے۔`;
text.path9 = `لوڈ ہو رہا ہے۔...`;
text.path10 = `درجہ بندی`;
text.path11 = `تصدیق کریں۔`;
text.path12 = `لیگ میں {0} مقام پر پہنچنے اور بونس {1} حاصل کرنے پر مبارکباد`;